# -*- coding: utf-8-unix; lexical-binding: t -*-
#+TITLE: 简明 PostgreSQL
#+LANGUAGE: zh-CN
#+AUTHOR: [[https://github.com/shynur][/谢骐/]]
#+HTML_HEAD: <style> table, th, td {border: 1px solid;} code {box-sizing: border-box; background-color: #F3F5F9; color: #0ABF5B;} .tag {color: #9370db;} </style>

** 表的创建                                   :CREATE:TABLE:

#+CAPTION: 在数据库“shop”中创建名为“Products”的表.
#+BEGIN_SRC sql  :eval query
CREATE TABLE Products (
  -- 列名       数据类型     [约束]
  product_id      CHAR(4)   NOT NULL,
  product_name VARCHAR(100) NOT NULL,
  product_type VARCHAR(32)  NOT NULL,
      sale_price INTEGER            ,
  purchase_price INTEGER            ,
  regist_date    DATE               ,
  -- 除了 ‘NOT NULL’, 其余约束可在末尾设置:
  PRIMARY KEY (product_id)
);
#+END_SRC

#+RESULTS:
|---|

执行以下代码[fn:BEGIN_TRANSACTION: 对于 ~BEGIN TRANSACTION;~ 这行, 在 MySQL 中使用 ~START TRANSACTION;~; 在 Oracle 和 DB2 中不需要这句, 后文不再赘述.  见[[*Transaction]].]以插入本文使用的示例数据:

#+NAME: 填充“Products”表
#+BEGIN_SRC sql
BEGIN TRANSACTION;     /* product_id         product_type    purchase_price
                              |   product_name    |    sale_price  |   regist_date */
INSERT INTO Products VALUES('0001', 'T恤衫'  , '衣服'    , 1000,  500, '2009-09-20');
INSERT INTO Products VALUES('0002', '打孔器' , '办公用品',  500,  320, '2009-09-11');
INSERT INTO Products VALUES('0003', '运动T恤', '衣服'    , 4000, 2800,         NULL);
INSERT INTO Products VALUES('0004', '菜刀'   , '厨房用具', 3000, 2800, '2009-09-20');
INSERT INTO Products VALUES('0005', '高压锅' , '厨房用具', 6800, 5000, '2009-01-15');
INSERT INTO Products VALUES('0006', '叉子'   , '厨房用具',  500, NULL, '2009-09-20');
INSERT INTO Products VALUES('0007', '擦菜板' , '厨房用具',  880,  790, '2008-04-28');
INSERT INTO Products VALUES('0008', '圆珠笔' , '办公用品',  100, NULL, '2009-11-11');
COMMIT;
#+END_SRC

#+RESULTS: 填充“Products”表
| BEGIN      |
|------------|
| INSERT 0 1 |
| INSERT 0 1 |
| INSERT 0 1 |
| INSERT 0 1 |
| INSERT 0 1 |
| INSERT 0 1 |
| INSERT 0 1 |
| INSERT 0 1 |
| COMMIT     |

*** ~NULL~ 清空                                       :NULL:

#+CAPTION: 将编号为 8 的登记日期清空
#+BEGIN_SRC sql  :eval query
 UPDATE Products
 SET regist_date = NULL
 WHERE product_id = '0008';
#+END_SRC

#+RESULTS:
| UPDATE 1 |
|----------|

注意, 只有未设置 ~NOT NULL~ 约束和 ~PRIMARY KEY~ 约束的列才可以清空.

*** 多列更新

有两种书写方式:

#+BEGIN_SRC sql  :eval query
  UPDATE Products
  SET sale_price     = sale_price / 10,
      purchase_price = purchase_price / 2
  WHERE product_type = '厨房用具';
#+END_SRC

和

#+BEGIN_SRC sql  :eval query
 UPDATE Products
 SET (sale_price,      purchase_price)
   = (sale_price / 10, purchase_price / 2)
 WHERE product_type = '厨房用具';
#+END_SRC

#+RESULTS:
| UPDATE 3 |
|----------|

所有的 RDBMS 都支持前一种写法; 后一种写法不太常用 (但 PostgreSQL 和 DB2 是支持的).

** 更新视图中的数据行

在 ~SELECT~ 语句中[[视图的查询][视图可以和表一样使用]].
那么, 对于 ~INSERT~​/​~DELETE~​/​~UPDATE~ 这类语句, 会怎么样呢?  \\
实际上, 虽然这其中有很严格的限制, 但确实可以对视图进行更新.
标准 SQL 中有这样的规定: 如果定义视图的 ~SELECT~ 语句能够满足某些条件, 那么这个视图就可以被更新.
下面列举一些具有代表性的条件:
- 没有使用 ~DISTINCT~ 修饰 ~SELECT~ 子句
- ~FROM~ 子句中只有一张表[fn:: 第[[*查询]]章只介绍了如何查询 \( 1 \) 张表的数据, 实际上 \( 1 \) 条 ~SELECT~ 语句可以同时查询多张表.]
- 未使用 ~GROUP BY~ 子句[fn:: 所以肯定也没使用 ~HAVING~ 子句.]

来看一个正面的例子.  \\
首先新建示例视图“ProductsOffice”:

#+CAPTION: 用“Products”表中的“办公用品”类商品创建一个视图
#+BEGIN_SRC sql  :eval query
 CREATE VIEW ProductsOffice (
   product_id, product_name, product_type, sale_price, purchase_price, regist_date
 ) AS SELECT *
      FROM Products
      WHERE product_type = '办公用品';
#+END_SRC

然后, 由于 PostgreSQL (的某些版本) 中的视图在创建时默认被设定为只读, 所以需要先修改[fn:: DB2 和 MySQL 等其它 RDBMS 则不需要.]这个选项:

#+CAPTION: 允许更新视图“ProductsOffice”的数据
#+BEGIN_SRC sql
 CREATE OR REPLACE RULE insert_rule
 AS ON INSERT TO ProductsOffice
 DO INSTEAD
 INSERT INTO Products VALUES (
   new.product_id,
   new.product_name,
   new.product_type,
   new.sale_price,
   new.purchase_price,
   new.regist_date
 );
#+END_SRC

#+RESULTS:
| CREATE RULE |
|-------------|

现在可以插入新行了:

#+BEGIN_SRC sql  :eval query
 INSERT INTO ProductsOffice VALUES
 ('0009',   '印章', '办公用品',    95,    10, '2009-11-30'),
 ('1010', '羽绒服',     '衣服', 19600, 10980, '2023-12-21');
#+END_SRC

#+RESULTS:
| INSERT 0 1 |
|------------|

#+CAPTION:  查看是否添加成功
#+BEGIN_SRC sql
 SELECT * FROM Products WHERE product_type = '办公用品' OR product_id = '1010';
 \qecho
 SELECT * FROM ProductsOffice;
#+END_SRC

#+RESULTS:
| product_id | product_name | product_type | sale_price | purchase_price | regist_date |
|------------+--------------+--------------+------------+----------------+-------------|
|       0002 | 打孔器       | 办公用品     |        500 |            320 |  2009-09-11 |
|       0008 | 圆珠笔       | 办公用品     |        100 |                |  2009-11-11 |
|       0009 | 印章         | 办公用品     |         95 |             10 |  2009-11-30 |
|       1010 | 羽绒服       | 衣服         |      19600 |          10980 |  2023-12-21 |
|            |              |              |            |                |             |
| product_id | product_name | product_type | sale_price | purchase_price | regist_date |
|       0002 | 打孔器       | 办公用品     |        500 |            320 |  2009-09-11 |
|       0008 | 圆珠笔       | 办公用品     |        100 |                |  2009-11-11 |
|       0009 | 印章         | 办公用品     |         95 |             10 |  2009-11-30 |

* 子查询

一言以蔽之, 子查询 (subquery) 就是一次性[[*视图][视图]][fn:: 所以, 子查询当然也是可以嵌套的, 就像[[视图“ProductsTypeInfoOffice”][视图“ProductsTypeInfoOffice”]]那样.].
它的用法是, 将用来定义视图的 ~SELECT~ 语句直接写到各种子句[fn:: 除了[[*标量子查询][标量子查询]], 其余主要是写到 ~FROM~ 子句中.]当中, 如果是写在 ~FROM~ 子句中, 还需要​*取上合适的别名*.

我们将[[*视图的创建与查询]]中的例子修改为使用子查询实现:

#+CAPTION: 相当于查询[[视图“ProductsTypeInfo”][视图“ProductsTypeInfo”]]的数据
#+BEGIN_SRC sql
  SELECT product_type,
         "商品种数"
  FROM (SELECT product_type,
               COUNT(*) AS "商品种数"
        FROM Products
        GROUP BY product_type) AS ProductsTypeInfo;
-- 在 Oracle 的 FROM 子句中,  ^^^^ 不能使用 AS, 因此需要删去它.
#+END_SRC

#+RESULTS:
| product_type | 商品种数 |
|--------------+----------|
| 衣服         |        3 |
| Other Type   |        1 |
| 办公用品     |        3 |
| 厨房用具     |        4 |

** 标量子查询

就是返回结果是 \( 1 \times 1 \) 矩阵[fn:: 不考虑用来显示列的名字的那一行.]的子查询.
因此, 也能当作单一的值 (scalar) 来处理.
通常, 任何可以使用标量的位置都可以使用标量子查询, 也就是说几乎所有的地方都可以使用[fn:: 但未必会获得预期的结果, e.g., [[https://stackoverflow.com/q/77698620/20212483][Question: “~ORDER BY~ a /scalar subquery/​”]].].

我们要选取 \( \text{售价} \le \text{均价} \) 的商品, 可能会想这么写:

#+CAPTION: (错误的写法) 从“Products”表中选取 \( \text{售价} \le \text{均价} \) 的商品
#+BEGIN_SRC sql  :eval never
  SELECT product_name,
         sale_price
  FROM Products
  WHERE sale_price <= AVG(sale_price);
#+END_SRC

#+RESULTS:
|---|

但[[*不要在 ~WHERE~ 子句中使用聚合函数]]说过这是错误的写法, 以及为什么是错的.
正确的写法是用标量子查询:

#+NAME: 售价<=均价
#+CAPTION: 从“Products”表中选取 \( \text{售价} \le \text{均价} \) 的商品
#+BEGIN_SRC sql
  SELECT product_name,
         sale_price
  FROM Products
  WHERE sale_price <= (SELECT AVG(sale_price)
                       FROM Products);
#+END_SRC

** 关联子查询                                           :AS:

E.g., 我们要选出各“品类”下 \( \text{售价} \le \text{品类均价} \) 的商品[fn:: 作为对比, 选出 \( \text{售价} \le \text{均价} \) 的代码, 见[[售价<=均价]]], 可能会想这么写:

#+CAPTION: (错误的写法) 从“Products”表中选取 \( \text{售价} \le \text{品类均价} \) 的商品
#+BEGIN_SRC sql  :eval never
  SELECT product_type,
         product_name,
         sale_price
  FROM Products
  --      scalar  v.s.  vector:
  WHERE sale_price <= (SELECT AVG(sale_price)
                       FROM Products
                       GROUP BY product_type);
#+END_SRC

这是错的, 因为标量与向量是不可比较的, 而上述代码中的 ~WHERE~ 子句中却将标量与一个返回多行表的子查询进行比较.
正确的写法是

#+NAME: 售价<=品类均价
#+CAPTION: 从“Products”表中选取 \( \text{售价} \le \text{品类均价} \) 的商品
#+BEGIN_SRC sql
  SELECT product_type,
         product_name,
         sale_price
  FROM Products /* AS ProductsAlias */
  WHERE sale_price <= (SELECT AVG(sale_price)
                       FROM Products AS ProductsOfType
                       -- Oracle 中 ^^^^ 请删掉‘AS’关键字.  (后文不再赘述.)
                       WHERE ProductsOfType.product_type = Products.product_type);
#+END_SRC

#+RESULTS:
| product_type | product_name | sale_price |
|--------------+--------------+------------|
| 衣服         | T恤衫        |       1000 |
| 衣服         | 运动T恤      |       4000 |
| 厨房用具     | 叉子         |        500 |
| 厨房用具     | 擦菜板       |        880 |
| 办公用品     | 圆珠笔       |        100 |
| 办公用品     | 印章         |         95 |

其中 =ProductsOfType= 是子查询为自己的“Products”表起的别名, 子查询使用这个别名在 ~WHERE~ 子句中指定关联条件.  (Table 的​/别名/​会 [[https://wikipedia.org/wiki/Variable_shadowing][/shadow/]] 原本的名[fn:: 见 [[https://stackoverflow.com/a/15318375/20212483]].], 所以在上述代码中, 出现在子查询的 ~WHERE~ 子句中的“Products”指的就是​_外层查询中的那张表_, 并不会产生歧义[fn:: 如果担心自己会混淆, 你当然可以给外层查询中的表也起个别名.].)
在该语境下, 别名被称为​/关联名称/, 子查询被称为​/关联子查询/.

*** ~MOD~ 函数

就是数学中的 /modulo/.
由于小数运算并没有余数的概念, 所以只能对​_整数_​使用该函数.

#+CAPTION: ~MOD~ 函数的用法示例
#+BEGIN_SRC sql  :exports both table
  SELECT p AS "被除数",
         q AS "除数",
         MOD(p, q) AS "余数"  -- SQL Server 使用‘%’算术运算符表示取模.
  FROM SampleMath;
#+END_SRC

#+RESULTS:
| 被除数 | 除数 | 余数 |
|--------+------+------|
|      0 |      |      |
|      0 |      |      |
|        |      |      |
|      7 |    3 |    1 |
|      5 |    2 |    1 |
|      4 |      |      |
|      3 |      |      |
|      1 |      |      |
|      2 |      |      |
|      1 |      |      |

*** ~ROUND~ 函数

I.e., /*四舍五入*/.

#+CAPTION: ~ROUND~ 函数的用法示例
#+BEGIN_SRC sql  :exports both table
  SELECT m AS "实际值",
         p AS "保留几位小数",
         ROUND(m, p) AS "近似值"
  FROM SampleMath;
#+END_SRC

#+RESULTS:
|   实际值 | 保留几位小数 | 近似值 |
|----------+--------------+--------|
|  500.000 |            0 |    500 |
| -180.000 |            0 |   -180 |
|          |              |        |
|        7 |              |        |
|        5 |              |        |
|        4 |              |        |
|    8.000 |              |        |
|    2.270 |            1 |    2.3 |
|    5.555 |            2 |   5.56 |
|        1 |              |        |
|    8.760 |              |        |

N.b., PostgreSQL 中 ~ROUND~ 函数的 1st 参数只接受 ~NUMERIC~ 类型, 2nd 参数可以是负数;

** [20%] 字符串函数

#+CAPTION: 新建示例用表“SampleString”
#+BEGIN_SRC sql  :eval query
  CREATE TABLE SampleString (s1 VARCHAR(40),
                             s2 VARCHAR(40),
                             s3 VARCHAR(40));

  BEGIN TRANSACTION;
  INSERT INTO SampleString (s1, s2, s3) VALUES (      'opx',   'rt',  NULL );
  INSERT INTO SampleString (s1, s2, s3) VALUES (      'abc',  'def',  NULL );
  INSERT INTO SampleString (s1, s2, s3) VALUES (       '碇', '真嗣', '探病');
  INSERT INTO SampleString (s1, s2, s3) VALUES (      'aaa',  NULL ,  NULL );
  INSERT INTO SampleString (s1, s2, s3) VALUES (      NULL ,  'xyz',  NULL );
  INSERT INTO SampleString (s1, s2, s3) VALUES (    '@!#$%',  NULL ,  NULL );
  INSERT INTO SampleString (s1, s2, s3) VALUES (      'ABC',  NULL ,  NULL );
  INSERT INTO SampleString (s1, s2, s3) VALUES (      'aBC',  NULL ,  NULL );
  INSERT INTO SampleString (s1, s2, s3) VALUES (  'abc太郎',  'abc',  'ABC');
  INSERT INTO SampleString (s1, s2, s3) VALUES ('abcdefabc',  'abc',  'ABC');
  INSERT INTO SampleString (s1, s2, s3) VALUES (   'micmic',    'i',    'I');
  COMMIT;
#+END_SRC

#+RESULTS:
| CREATE TABLE |
|--------------|
| BEGIN        |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| COMMIT       |

*** DONE 拼接字符串                                 :CONCAT:

#+CAPTION: 演示如何拼接字符串
#+BEGIN_SRC sql  :exports both table
  SELECT s1, s2, s3,
         s1 || s2 || s3 AS "拼接“s1”, “s2”, 和“s3”"
  --         SQL Server       : s1 + s2 +s3
  -- SQL Server 2012+ 或 MySQL: CONCAT(s1, s2, s3)
  FROM SampleString;
#+END_SRC

#+RESULTS:
| s1        | s2   | s3   | 拼接“s1”, “s2”, 和“s3” |
|-----------+------+------+------------------------|
| opx       | rt   |      |                        |
| abc       | def  |      |                        |
| 碇        | 真嗣 | 探病 | 碇真嗣探病             |
| aaa       |      |      |                        |
| xyz       |      |      |                        |
| @!#$%     |      |      |                        |
| ABC       |      |      |                        |
| aBC       |      |      |                        |
| abc太郎   | abc  | ABC  | abc太郎abcABC          |
| abcdefabc | abc  | ABC  | abcdefabcabcABC        |
| micmic    | i    | I    | micmiciI               |

N.b., ~||~ 并没有特殊对待 ~NULL~, i.e., 若 ~NULL~ 是操作数 则结果仍为 ~NULL~.

*** 数据类型的转换                                    :CAST:

#+CAPTION: ~CAST~ 函数的用法示例: 字符串 \to 数值
#+BEGIN_SRC sql  :exports both table
  -- SQL Server 和 PostgreSQL:
    SELECT CAST('001' AS        INTEGER); /*
  MySQL:
    SELECT CAST('001' AS SIGNED INTEGER);
  Oracle:
    SELECT CAST('001' AS        INTEGER) FROM DUAL;
  DB2:
    SELECT CAST('001' AS        INTEGER) FROM SYSIBM.SYSDUMMY1; */
#+END_SRC

#+RESULTS:
| int4 |
|------|
|    1 |

#+CAPTION: ~CAST~ 函数的用法示例: 字符串 \to 日期
#+BEGIN_SRC sql  :exports both table
  -- SQL Server, PostgreSQL, 和 MySQL:
    SELECT CAST('Dec 10, 2002' AS DATE); /*
  Oracle
    SELECT CAST('Dec 10, 2002' AS DATE) FROM DUAL;
  DB2
    SELECT CAST('Dec 10, 2002' AS DATE) FROM SYSIBM.SYSDUMMY1; */
#+END_SRC

#+RESULTS:
|       date |
|------------|
| 2002-12-10 |

-----

N.b., *书写 SQL 时必须要保证<<查询结果中列的类型要相同>>查询结果中的所有行在同一列上的数据类型是一致的!**
这也是 ~CAST~ 函数的另一个用武之地.

*** 返回第一个 non-~NULL~ 值                      :COALESCE:

将 ~NULL~ 作为参数时, 绝大多数函数的返回值都仍是 ~NULL~.
作为对比, ~COALESCE~ (接受任意多个参数) 会返回左数第一个 non-~NULL~ 值, 只有当参数都是 ~NULL~ 时才返回 ~NULL~.

#+CAPTION: ~COALESCE~ 函数的用法示例
#+BEGIN_SRC sql  :exports both table
  -- SQL Server, PostgreSQL, 和 MySQL:
    SELECT COALESCE(NULL, 17),
           COALESCE(NULL, 'C++', '23'); /*
  Oracle
    SELECT COALESCE(NULL, 17),
           COALESCE(NULL, 'C++', '23') FROM DUAL;
  DB2
    SELECT COALESCE(NULL, 17),
           COALESCE(NULL, 'C++', '23') FROM SYSIBM.SYSDUMMY1; */
#+END_SRC

#+RESULTS:
| coalesce | coalesce |
|----------+----------|
|       17 | C++      |

#+CAPTION: ~COALESCE~ 函数的用法示例: 打印 ~NULL~ 值, 而不是留空
#+BEGIN_SRC sql  :exports both table
  SELECT s2,
         COALESCE(s2, 'NULL')
  FROM SampleString;
#+END_SRC

#+RESULTS:
| s2  | coalesce |
|-----+----------|
| rt  | rt       |
| def | def      |
| 嗣  | 嗣       |
|     | NULL     |
| xyz | xyz      |
|     | NULL     |
|     | NULL     |
|     | NULL     |
| abc | abc      |
| abc | abc      |
| i   | i        |

N.b., 在 PostgreSQL 中, ~COALESCE~ 函数只接受相同类型的参数.

** 字符串的模式匹配                                   :LIKE:

#+CAPTION: 新建示例用表“SampleLike”
#+BEGIN_SRC sql  :eval query
  CREATE TABLE SampleLike (s VARCHAR(6) PRIMARY KEY);

  BEGIN TRANSACTION;
  INSERT INTO SampleLike (s) VALUES ('abcddd');
  INSERT INTO SampleLike (s) VALUES ('dddabc');
  INSERT INTO SampleLike (s) VALUES ('abdddc');
  INSERT INTO SampleLike (s) VALUES ('abcdd' );
  INSERT INTO SampleLike (s) VALUES ('ddabc' );
  INSERT INTO SampleLike (s) VALUES ('abddc' );
  COMMIT;
#+END_SRC

#+RESULTS:
| CREATE TABLE |
|--------------|
| BEGIN        |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| INSERT 0 1   |
| COMMIT       |

*** 视为任意文本的通配符

#+CAPTION: 通配符 ~'%'~ 的用法示例
#+BEGIN_SRC sql  :exports both table
  SELECT s AS " ddd…" FROM SampleLike WHERE s LIKE 'ddd%' ; \qecho
  SELECT s AS "…ddd…" FROM SampleLike WHERE s LIKE '%ddd%'; \qecho
  SELECT s AS "…ddd " FROM SampleLike WHERE s LIKE  '%ddd';
#+END_SRC

#+RESULTS:
| ddd…   |
|--------|
| dddabc |
|        |
| …ddd…  |
| abcddd |
| dddabc |
| abdddc |
|        |
| …ddd   |
| dddabc |
| abdddc |
| abcdd  |
| ddabc  |
| abddc  |

*** 视为单一字符的通配符

#+CAPTION: 通配符 ~'_'~ 的用法示例
#+BEGIN_SRC sql  :exports both table
  SELECT s AS "abc__ " FROM SampleLike WHERE s LIKE 'abc__' ; \qecho
  SELECT s AS "abc___" FROM SampleLike WHERE s LIKE 'abc___';
#+END_SRC

#+RESULTS:
| abc__  |
|--------|
| abcdd  |
|        |
| abc___ |
| abcddd |

** 值是否在​/闭区间/​内                            :BETWEEN:

#+CAPTION: 选取 \( 100 \le \text{售价} \le 1000 \) 的商品
#+BEGIN_SRC sql  :exports both table
  SELECT product_name,
         sale_price
  FROM Products
  WHERE sale_price BETWEEN 100 AND 1000;
#+END_SRC

#+RESULTS:
| product_name | sale_price |
|--------------+------------|
| T恤衫        |       1000 |
| 打孔器       |        500 |
| 叉子         |        500 |
| 擦菜板       |        880 |
| 圆珠笔       |        100 |

** 值是否为 ~NULL~                             :IS:NOT:NULL:

#+CAPTION: 仅选取记录了“进价”的商品
#+BEGIN_SRC sql  :exports both table
  SELECT product_name, purchase_price
  FROM Products
  WHERE purchase_price IS NOT NULL;
#+END_SRC

#+RESULTS:
| product_name | purchase_price |
|--------------+----------------|
| T恤衫        |            500 |
| 打孔器       |            320 |
| 运动T恤      |           2800 |
| 菜刀         |           2800 |
| 高压锅       |           5000 |
| 擦菜板       |            790 |
| 印章         |             10 |
| 羽绒服       |          10980 |

** 值是否在集合中                                   :NOT:IN:

#+NAME: “进价”∈{320,500,5000}
#+CAPTION: 选出“进价”是 \( 320 \)/\( 500 \)/\( 5000 \)元 的商品
#+BEGIN_SRC sql  :exports both table
  SELECT product_name,
         purchase_price
  FROM Products
  WHERE purchase_price IN (320, 500, 5000);
#+END_SRC

#+RESULTS:
| product_name | purchase_price |
|--------------+----------------|
| T恤衫        |            500 |
| 打孔器       |            320 |
| 高压锅       |           5000 |

#+NAME: “进价”∉{320,500,5000}
#+CAPTION: 选出“进价”不是 \( 320 \)/\( 500 \)/\( 5000 \)元 的商品
#+BEGIN_SRC sql  :exports both table
  SELECT product_name,
         purchase_price
  FROM Products
  WHERE purchase_price NOT IN (320, 500, 5000);
#+END_SRC

#+RESULTS:
| product_name | purchase_price |
|--------------+----------------|
| 运动T恤      |           2800 |
| 菜刀         |           2800 |
| 擦菜板       |            790 |
| 印章         |             10 |
| 羽绒服       |          10980 |

*** ~IN~ 无法判断值是否为 ~NULL~                      :NULL:

不管是 ~IN~ 还是 ~NOT IN~ 都无法判断值是否为 ~NULL~.

#+CAPTION: 将前文中 [[“进价”∈{320,500,5000}][~IN~ 的例子]]和 [[“进价”∉{320,500,5000}][~NOT IN~ 的例子]]中的行数相加, 会发现并不等于 \( \text{商品总数} \)
#+BEGIN_SRC sql  :exports both table
  SELECT (SELECT COUNT(*)
          FROM Products
          WHERE purchase_price IN (320, 500, 5000))
         + (SELECT COUNT(*)
            FROM Products
            WHERE purchase_price NOT IN (320, 500, 5000))
         = COUNT(*)  -- 改成“COUNT(purchase_price)”就会返回‘TRUE‘.
  FROM Products;
#+END_SRC

#+RESULTS:
| ?column? |
|----------|
| f        |

-----

但集合中是可以含 ~NULL~ 的, 根据[[真值表][真值表]]计算布尔值即可.
E.g.,

#+BEGIN_SRC sql  :exports both table
  SELECT 1     IN (NULL),     -- unknown
         1     IN (NULL, 1),  -- unknown OR true
         1 NOT IN (NULL),     -- NOT (unknown)
         1 NOT IN (NULL, 1);  -- NOT (unknown OR true)
#+END_SRC

#+RESULTS:
| ?column? | ?column? | ?column? | ?column? |
|----------+----------+----------+----------|
|          | t        |          | f        |

*** 将​/子查询/​作为 ~IN~ 的宾语                    :SELECT:

#+CAPTION: 新建示例用表“ShopsInventory”
#+BEGIN_SRC sql  :eval query
  CREATE TABLE ShopsInventory (
    shop_id      CHAR(4)   NOT NULL,
    shop_name VARCHAR(200) NOT NULL,
    product_id   CHAR(4)   NOT NULL,
    quantity  INTEGER      NOT NULL,
    PRIMARY KEY (shop_id, product_id)
  );

  BEGIN TRANSACTION;
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000A',   '东京', '0001',  30);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000A',   '东京', '0002',  50);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000A',   '东京', '0003',  15);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000B', '名古屋', '0002',  30);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000B', '名古屋', '0003', 120);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000B', '名古屋', '0004',  20);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000B', '名古屋', '0006',  10);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000B', '名古屋', '0007',  40);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000C',   '大阪', '0003',  20);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000C',   '大阪', '0004',  50);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000C',   '大阪', '0006',  90);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000C',   '大阪', '0007',  70);
  INSERT INTO ShopsInventory (shop_id, shop_name, product_id, quantity) VALUES ('000D',   '福冈', '0001', 100);
  COMMIT;
#+END_SRC

#+CAPTION: 选取大阪店 (“000C”) 正在销售的商品的售价
#+BEGIN_SRC sql  :exports both table
  SELECT product_name,
         sale_price
  FROM Products
  WHERE product_id IN (SELECT product_id
                       FROM ShopsInventory
                       WHERE shop_id = '000C');
#+END_SRC

#+RESULTS:
| product_name | sale_price |
|--------------+------------|
| 运动T恤      |       4000 |
| 菜刀         |       3000 |
| 叉子         |        500 |
| 擦菜板       |        880 |

** 表中是否存在记录                                 :EXISTS:

~EXISTS~​/​~NOT EXISTS~ 用于判断表是否非空 (i.e., \( \text{行数} \gt 0 \)).

#+CAPTION: 选取大阪店 (“000C”) 正在销售的商品的售价
#+BEGIN_SRC sql  :exports both table
  SELECT product_name,
         sale_price
  FROM Products
  WHERE EXISTS (SELECT *  -- 并不关心到底选取了哪些列, 因此填‘NULL’也无所谓.
                FROM ShopsInventory
                WHERE shop_id = '000C'
                      AND ShopsInventory.product_id = Products.product_id);
#+END_SRC

#+RESULTS:
| product_name | sale_price |
|--------------+------------|
| 运动T恤      |       4000 |
| 菜刀         |       3000 |
| 叉子         |        500 |
| 擦菜板       |        880 |

** 搜索型 ~CASE~ 表达式

#+CAPTION: 搜索型 ~CASE~ 表达式的基本结构
#+BEGIN_SRC sql  :eval never
  CASE
    WHEN <布尔表达式_1> THEN
      <表达式_1>
    WHEN <布尔表达式_2> THEN
      <表达式_2>
    … …
    [ELSE <表达式_0>]
  END
#+END_SRC

它的执行相当于 Common Lisp 中的 ~cond~ 宏[fn:在CASE表达式中省略ELSE子句: 在 ~CASE~ 表达式中省略 ~ELSE~ 子句时, 相当于显式的 ~ELSE NULL~.  这两种语言在这一点上也是类似的.]:

#+BEGIN_SRC common-lisp  :eval never
  (cond
   ((布尔表达式_1) (表达式_1))
   ((布尔表达式_2) (表达式_2))
   (t              (表达式_0)))
#+END_SRC

-----

来看一个​/列向量/​转置成​/行向量/​的例子:

#+CAPTION: 用一个​/列向量/​列出每种品类下商品的总售价
#+BEGIN_SRC sql  :exports both table
  SELECT product_type,
         SUM(sale_price) AS "该品类商品的总售价"
  FROM Products
  GROUP BY product_type;
#+END_SRC

#+RESULTS:
| product_type | 该品类商品的总售价 |
|--------------+--------------------|
| 衣服         |              24600 |
| Other Type   |                    |
| 办公用品     |                695 |
| 厨房用具     |              11180 |

#+CAPTION: 用一个​/行向量/​列出每种品类下商品的总售价
#+BEGIN_SRC sql  :exports both table
  SELECT SUM(CASE
               WHEN product_type = '衣服' THEN
                 sale_price
               ELSE
                 0
             END),
         SUM(CASE
               WHEN product_type = '厨房用具' THEN
                 sale_price
             END),
         SUM(CASE
               WHEN product_type = '办公用品' THEN
                 sale_price
             END)
 FROM Products;
#+END_SRC

#+RESULTS:
|   sum |   sum | sum |
|-------+-------+-----|
| 24600 | 11180 | 695 |

*** 表的加法                                         :UNION:

#+CAPTION: 合并“Products”和“Products2”
#+BEGIN_SRC sql
    SELECT product_id, product_name
    FROM Products
  UNION /* ALL */
    SELECT product_id, product_name
    FROM Products2
  ORDER BY product_id;
#+END_SRC

#+RESULTS:
| product_id | product_name |
|------------+--------------|
|       0001 | T恤衫        |
|       0002 | 打孔器       |
|       0003 | 运动T恤      |
|       0004 | 菜刀         |
|       0005 | 高压锅       |
|       0006 | 叉子         |
|       0007 | 擦菜板       |
|       0008 | 圆珠笔       |
|       0009 | 印章         |
|       0009 | 手套         |
|       0010 | 水壶         |
|       1001 | No name      |
|       1010 | 羽绒服       |

*** 选取同时出现在多张表中的行                   :INTERSECT:

(MySQL 尚不支持该功能.)

#+CAPTION: 选取“Products”表和“Products2”中都有的商品
#+BEGIN_SRC sql
    SELECT product_id, product_name
    FROM Products
  INTERSECT
    SELECT product_id, product_name
    FROM Products2;
#+END_SRC

#+RESULTS:
| product_id | product_name |
|------------+--------------|
|       0002 | 打孔器       |
|       0001 | T恤衫        |
|       0003 | 运动T恤      |

*** 排除也出现在其它表中的行                  :EXCEPT:MINUS:

(MySQL 尚不支持该功能; Oracle 使用 ~MINUS~ 关键字而非 ~EXCEPT~.)

#+CAPTION: 选取“Products2”表中的商品, 但排除那些在“Products”中出现过的
#+BEGIN_SRC sql
    SELECT product_id, product_name
    FROM Products2
  EXCEPT
    SELECT product_id, product_name
    FROM Products;
#+END_SRC

#+RESULTS:
| product_id | product_name |
|------------+--------------|
|       0010 | 水壶         |
|       0009 | 手套         |

*** 内联结                                           :INNER:

#+NAME: 内联结ShopsInventory与Products
#+CAPTION: 整合“ShopsInventory”表和“Products”表的数据, 取出 商品的部分信息 与 各家店中该商品的在售数量.  _若某条记录表明, 某店正在销售的商品不在“Products”表​*内* / 某商品不被“ShopsInventory”表​*内*​的任何一家店铺售卖, 则忽略该条记录._
#+BEGIN_SRC sql  :exports both table
  SELECT shop_id, shop_name,
         ShopsInventory.product_id,
         product_name, sale_price
 FROM ShopsInventory  -- 联结键: vvvvvvvvvv                  vvvvvvvvvv
 INNER JOIN Products ON Products.product_id = ShopsInventory.product_id
 --           联结条件: ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 /* WHERE sale_price > 900 */;
#+END_SRC

#+RESULTS: 内联结ShopsInventory与Products
| shop_id | shop_name | product_id | product_name | sale_price |
|---------+-----------+------------+--------------+------------|
| 000A    | 东京      |       0001 | T恤衫        |       1000 |
| 000A    | 东京      |       0002 | 打孔器       |        500 |
| 000A    | 东京      |       0003 | 运动T恤      |       4000 |
| 000B    | 名古屋    |       0002 | 打孔器       |        500 |
| 000B    | 名古屋    |       0003 | 运动T恤      |       4000 |
| 000B    | 名古屋    |       0004 | 菜刀         |       3000 |
| 000B    | 名古屋    |       0006 | 叉子         |        500 |
| 000B    | 名古屋    |       0007 | 擦菜板       |        880 |
| 000C    | 大阪      |       0003 | 运动T恤      |       4000 |
| 000C    | 大阪      |       0004 | 菜刀         |       3000 |
| 000C    | 大阪      |       0006 | 叉子         |        500 |
| 000C    | 大阪      |       0007 | 擦菜板       |        880 |
| 000D    | 福冈      |       0001 | T恤衫        |       1000 |

(上述的内联结示例代码还有一种过时的写法, 见脚注[fn:: ~SELECT shop_id, shop_name, ShopsInventory.product_id, product_name, sale_price FROM ShopsInventory, Products WHERE Products.product_id = ShopsInventory.product_id /* AND sale_price > 900 */;~].  虽然能在所有的 RDBMS 中执行, 但早晚会被淘汰.)

联结时, ~ON~ 子句指出​*/联结条件/*[fn:: 可以用 与​/​或​/​非 组合多个​/联结条件/.], /联结条件/​所涉及的列称为​*/联结键/*.
~INNER JOIN <表名> ON~ 必须写在 ~FROM~ 子句中, 因为它也是用来指出从哪张表中选取记录的.

*** 外联结                                :OUTER:LEFT:RIGHT:

#+CAPTION: 整合“ShopsInventory”表和“Products”表的数据, 取出 商品的部分信息 与 各家店中该商品的在售数量.  若某条记录表明, 某店正在销售的商品在“Products”表以​*外* +某商品只被“ShopsInventory”表以​*外*​的店铺售卖+, 则忽略该条记录.
#+BEGIN_SRC sql  :exports both table
  SELECT shop_id, shop_name,
         Products.product_id,
         product_name, sale_price
 FROM ShopsInventory
 RIGHT OUTER JOIN Products ON ShopsInventory.product_id = Products.product_id;
#+END_SRC

#+RESULTS:
| shop_id | shop_name | product_id | product_name | sale_price |
|---------+-----------+------------+--------------+------------|
| 000A    | 东京      |       0001 | T恤衫        |       1000 |
| 000A    | 东京      |       0002 | 打孔器       |        500 |
| 000A    | 东京      |       0003 | 运动T恤      |       4000 |
| 000B    | 名古屋    |       0002 | 打孔器       |        500 |
| 000B    | 名古屋    |       0003 | 运动T恤      |       4000 |
| 000B    | 名古屋    |       0004 | 菜刀         |       3000 |
| 000B    | 名古屋    |       0006 | 叉子         |        500 |
| 000B    | 名古屋    |       0007 | 擦菜板       |        880 |
| 000C    | 大阪      |       0003 | 运动T恤      |       4000 |
| 000C    | 大阪      |       0004 | 菜刀         |       3000 |
| 000C    | 大阪      |       0006 | 叉子         |        500 |
| 000C    | 大阪      |       0007 | 擦菜板       |        880 |
| 000D    | 福冈      |       0001 | T恤衫        |       1000 |
|         |           |       0008 | 圆珠笔       |        100 |
|         |           |       0009 | 印章         |         95 |
|         |           |       1010 | 羽绒服       |      19600 |
|         |           |       0005 | 高压锅       |       6800 |

上述结果与[[内联结ShopsInventory与Products][内联结的查询示例]]的结果相比, 不同点显而易见:
/右外联结/​的查询结果引用了“Products”表中的​*所有*​记录.

/左\slash​右外联结/​以 ~OUTER JOIN~ 左​/​右侧的表为​*/主表/*; /主表/​中的所有记录都会被外联结的查询结果所引用.[fn:: 因此, ~<表1> LEFT OUTER JOIN <表2>~ 与 ~<表2> RIGHT OUTER JOIN <表1>~ 没啥区别, 通常使用 ~LEFT~ 的情况会多一些.]

*** 交叉联结                                         :CROSS:

/交叉联结/​是所有联结运算的基础.
它对两张表作 ​/Cartesian product/, 因此 ~CROSS JOIN~ 没有 ~ON~ 子句.

#+CAPTION: \( \{0, 1\} \times \{1, 2, 3\} = \{(0, 1), (0, 2), (0, 3), (1, 1), (1, 2), (1, 3)\} \)
#+BEGIN_SRC sql  :exports both table
  SELECT *
  FROM (SELECT 0 UNION SELECT 1)
  CROSS JOIN (SELECT 1 UNION SELECT 2 UNION SELECT 3);
#+END_SRC

#+RESULTS:
| ?column? | ?column? |
|----------+----------|
|        0 |        1 |
|        0 |        2 |
|        0 |        3 |
|        1 |        1 |
|        1 |        2 |
|        1 |        3 |

-----

~INNER~ 与 ~OUTER~ 的解释:
- [[*内联结][/内联结/]]是​/交叉联结/​的结果的​/*子*​集/;
- [[*外联结][/外联结/]]是​/交叉联结/​的结果的​/*超*​集/.

*** 联结三张以上的表

#+CAPTION: 新建示例用表“WarehouseInventory”: 货仓库存
#+BEGIN_SRC sql  :eval query
  CREATE TABLE WarehouseInventory (
    inventory_id       CHAR(4) NOT NULL,
      product_id       CHAR(4) NOT NULL,
    inventory_quantity INTEGER NOT NULL,
    PRIMARY KEY (inventory_id, product_id)
  );

  BEGIN TRANSACTION;
  INSERT INTO WarehouseInventory VALUES ('P001', '0001',   0);
  INSERT INTO WarehouseInventory VALUES ('P001', '0002', 120);
  INSERT INTO WarehouseInventory VALUES ('P001', '0003', 200);
  INSERT INTO WarehouseInventory VALUES ('P001', '0004',   3);
  INSERT INTO WarehouseInventory VALUES ('P001', '0005',   0);
  INSERT INTO WarehouseInventory VALUES ('P001', '0006',  99);
  INSERT INTO WarehouseInventory VALUES ('P001', '0007', 999);
  INSERT INTO WarehouseInventory VALUES ('P001', '0008', 200);
  INSERT INTO WarehouseInventory VALUES ('P002', '0001',  10);
  INSERT INTO WarehouseInventory VALUES ('P002', '0002',  25);
  INSERT INTO WarehouseInventory VALUES ('P002', '0003',  34);
  INSERT INTO WarehouseInventory VALUES ('P002', '0004',  19);
  INSERT INTO WarehouseInventory VALUES ('P002', '0005',  99);
  INSERT INTO WarehouseInventory VALUES ('P002', '0006',   0);
  INSERT INTO WarehouseInventory VALUES ('P002', '0007',   0);
  INSERT INTO WarehouseInventory VALUES ('P002', '0008',  18);
  COMMIT;
#+END_SRC

#+CAPTION: 在货仓“P001”中有库存, 且正在各家商店中售卖, 且出现在“Products”中 的商品的一些信息
#+BEGIN_SRC sql
  SELECT shop_id, shop_name,
         Products.product_id, Products.product_name, Products.sale_price,
         inventory_quantity
  FROM ShopsInventory
  INNER JOIN Products           ON Products.product_id = ShopsInventory.product_id
  INNER JOIN WarehouseInventory ON Products.product_id = WarehouseInventory.product_id
  WHERE inventory_id = 'P001';
#+END_SRC

#+RESULTS:
| shop_id | shop_name | product_id | product_name | sale_price | inventory_quantity |
|---------+-----------+------------+--------------+------------+--------------------|
| 000A    | 东京      |       0001 | T恤衫        |       1000 |                  0 |
| 000A    | 东京      |       0002 | 打孔器       |        500 |                120 |
| 000A    | 东京      |       0003 | 运动T恤      |       4000 |                200 |
| 000B    | 名古屋    |       0002 | 打孔器       |        500 |                120 |
| 000B    | 名古屋    |       0003 | 运动T恤      |       4000 |                200 |
| 000B    | 名古屋    |       0004 | 菜刀         |       3000 |                  3 |
| 000B    | 名古屋    |       0006 | 叉子         |        500 |                 99 |
| 000B    | 名古屋    |       0007 | 擦菜板       |        880 |                999 |
| 000C    | 大阪      |       0003 | 运动T恤      |       4000 |                200 |
| 000C    | 大阪      |       0004 | 菜刀         |       3000 |                  3 |
| 000C    | 大阪      |       0006 | 叉子         |        500 |                 99 |
| 000C    | 大阪      |       0007 | 擦菜板       |        880 |                999 |
| 000D    | 福冈      |       0001 | T恤衫        |       1000 |                  0 |

**** 为每一行提供有序编号       :RANK:ROW_NUMBER:DENSE_RANK:

#+BEGIN_SRC sql  :exports both table
  SELECT product_name, product_type, sale_price,
         RANK() OVER (PARTITION BY product_type ORDER BY sale_price)
  FROM Products;
#+END_SRC

#+RESULTS:
| product_name | product_type | sale_price | rank |
|--------------+--------------+------------+------|
| No name      | Other Type   |            |    1 |
| 印章         | 办公用品     |         95 |    1 |
| 圆珠笔       | 办公用品     |        100 |    2 |
| 打孔器       | 办公用品     |        500 |    3 |
| 叉子         | 厨房用具     |        500 |    1 |
| 擦菜板       | 厨房用具     |        880 |    2 |
| 菜刀         | 厨房用具     |       3000 |    3 |
| 高压锅       | 厨房用具     |       6800 |    4 |
| T恤衫        | 衣服         |       1000 |    1 |
| 运动T恤      | 衣服         |       4000 |    2 |
| 羽绒服       | 衣服         |      19600 |    3 |

上述代码中, 我们
- 使用 ~PARTITION BY~, 将记录按照 =product_type= 分隔成多个窗口;
- 然后使用 ~ORDER BY~, 分别为各窗口内的记录按照 =sale_price= 的升序提供编号.
N.b.,
 : RANK() OVER (… ORDER BY …)
并不保证查询结果中记录之间的顺序, 它只负责提供编号.[fn:: 虽然经常见到的情况是, 查询结果被有序地打印了出来.]

-----

#+CAPTION: \( 3 \) 种常见的编号方式: ~RANK~, ~ROW_NUMBER~, and ~DENSE_RANK~
#+BEGIN_SRC sql  :exports both tale
  SELECT product_name, sale_price,
               RANK() OVER (ORDER BY sale_price),
         ROW_NUMBER() OVER (ORDER BY sale_price),
         DENSE_RANK() OVER (ORDER BY sale_price)
  FROM Products
  WHERE sale_price BETWEEN 100 AND 999;
#+END_SRC

#+RESULTS:
| product_name | sale_price | rank | row_number | dense_rank |
|--------------+------------+------+------------+------------|
| 圆珠笔       |        100 |    1 |          1 |          1 |
| 打孔器       |        500 |    2 |          2 |          2 |
| 叉子         |        500 |    2 |          3 |          2 |
| 擦菜板       |        880 |    4 |          4 |          3 |

*** [#A] /聚合函数/​充当窗口函数     :COUNT:AVG:SUM:MIN:MAX:

只有部分​/聚合函数/​能作为​/窗口函数/​使用[fn:: 这些聚合函数列在本节标题后的 tag 清单中.], 本节仅以 ~AVG~ 举例.

#+CAPTION: 以“当前记录”为基准, 计算 \( \text{product_id} \le \text{当前的 product_id} \) 的商品们的平均售价
#+BEGIN_SRC sql  :exports both table
  SELECT product_id, product_name, sale_price,
         AVG(sale_price) OVER (ORDER BY product_id),  -- ‘AVG’依旧会忽视‘NULL’值.
         '前 ' || CAST(ROW_NUMBER() OVER (ORDER BY product_id)
                       AS VARCHAR) || ' 件商品的平均售价'
  FROM Products
  ORDER BY product_id;
#+END_SRC

#+RESULTS:
| product_id | product_name | sale_price |                   avg | ?column?               |
|------------+--------------+------------+-----------------------+------------------------|
|       0001 | T恤衫        |       1000 | 1000.0000000000000000 | 前 1 件商品的平均售价  |
|       0002 | 打孔器       |        500 |  750.0000000000000000 | 前 2 件商品的平均售价  |
|       0003 | 运动T恤      |       4000 | 1833.3333333333333333 | 前 3 件商品的平均售价  |
|       0004 | 菜刀         |       3000 | 2125.0000000000000000 | 前 4 件商品的平均售价  |
|       0005 | 高压锅       |       6800 | 3060.0000000000000000 | 前 5 件商品的平均售价  |
|       0006 | 叉子         |        500 | 2633.3333333333333333 | 前 6 件商品的平均售价  |
|       0007 | 擦菜板       |        880 | 2382.8571428571428571 | 前 7 件商品的平均售价  |
|       0008 | 圆珠笔       |        100 | 2097.5000000000000000 | 前 8 件商品的平均售价  |
|       0009 | 印章         |         95 | 1875.0000000000000000 | 前 9 件商品的平均售价  |
|       1001 | No name      |            | 1875.0000000000000000 | 前 10 件商品的平均售价 |
|       1010 | 羽绒服       |      19600 | 3647.5000000000000000 | 前 11 件商品的平均售价 |

**** 在​/窗口/​中滑动​/框架/ :ROWS:PRECEDING:FOLLOWING:BETWEEN:AND:

#+CAPTION: 计算“Products”表中 上方两个 和 自身 的平均售价 (i.e., 统计学中的​/移动平均/)
#+BEGIN_SRC sql  :exports both table
  SELECT product_id, product_name, sale_price,
         AVG(sale_price) OVER (ORDER BY product_id
                               ROWS 2 PRECEDING) AS "moving average"
  FROM Products;
#+END_SRC

#+RESULTS:
| product_id | product_name | sale_price |        moving average |
|------------+--------------+------------+-----------------------|
|       0001 | T恤衫        |       1000 | 1000.0000000000000000 |
|       0002 | 打孔器       |        500 |  750.0000000000000000 |
|       0003 | 运动T恤      |       4000 | 1833.3333333333333333 |
|       0004 | 菜刀         |       3000 | 2500.0000000000000000 |
|       0005 | 高压锅       |       6800 | 4600.0000000000000000 |
|       0006 | 叉子         |        500 | 3433.3333333333333333 |
|       0007 | 擦菜板       |        880 | 2726.6666666666666667 |
|       0008 | 圆珠笔       |        100 |  493.3333333333333333 |
|       0009 | 印章         |         95 |  358.3333333333333333 |
|       1001 | No name      |            |   97.5000000000000000 |
|       1010 | 羽绒服       |      19600 | 9847.5000000000000000 |

/框架/​宽度为 \( 3 \) 且包含当前记录时, ~ROWS~ 子句有三种写法:
-
  : ROWS 2 PRECEDING
  上上一个 + 上一个 + 当前记录.
-
  : ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING
  上一个 + 当前记录 + 下一个.
-
  : ROWS 2 FOLLOWING
  当前记录 + 下一个 + 下下一个.

** 大分组复用小分组                               :GROUPING:

#+BEGIN_SRC sql
    SELECT '各品类 合计' AS product_type, SUM(sale_price)
    FROM Products
  UNION ALL
    SELECT product_type || ' 合计', SUM(sale_price)
    FROM Products
    GROUP BY product_type;
#+END_SRC

#+RESULTS:
| product_type    |   sum |
|-----------------+-------|
| 各品类 合计     | 36475 |
| 衣服 合计       | 24600 |
| 办公用品 合计   |   695 |
| 厨房用具 合计   | 11180 |

